In [1]:
import pandas as pd
import numpy as np

In [2]:
#1. df1과 df2에 대해 merge 연습, on, left_on, right_on, how
#2. left과 right에 대해 merge 연습, on, left_on, right_on, how
#3. merge 열 이름과 행 인덱스를 기준으로 병합 연습
#4. merge연습, index 기준
#5. concat 연습, axis, join 속성 값 변경 설정
#6. stack, unstack 연습

In [3]:
df1 = pd.DataFrame(
    np.arange(6).reshape(3, 2),
    index=['a', 'b', 'c'],
    columns=['데이터1', '데이터2'])
df2 = pd.DataFrame(
    5 + np.arange(4).reshape(2, 2),
    index=['a', 'c'],
    columns=['데이터3', '데이터4'])
df1, df2

(   데이터1  데이터2
 a     0     1
 b     2     3
 c     4     5,
    데이터3  데이터4
 a     5     6
 c     7     8)

In [4]:
# pd.merge(df1, df2) # 중복되는 열(column)이 없어서 안됨
pd.merge(df1, df2, left_index=True, right_index=True) # 중복되는 행(index) 기준 병합
pd.merge(df1, df2, left_index=True, right_index=True, how='outer') # 병합 데이터 없을 시 NaN값 출력

pd.merge(df1, df2, left_on='데이터1', right_on='데이터3',how='outer') # 열 기준 병합(a,b,c 행 사라짐)
pd.concat([df1,df2])
pd.concat([df1,df2], axis=1)

   데이터1  데이터2  데이터3  데이터4
a     0     1   5.0   6.0
b     2     3   NaN   NaN
c     4     5   7.0   8.0

In [170]:
df1 = pd.DataFrame({
    '도시': ['서울', '서울', '서울', '부산', '부산'],
    '연도': [2000, 2005, 2010, 2000, 2005],
    '인구': [9853972, 9762546, 9631482, 3655437, 3512547]})
df2 = pd.DataFrame(
    np.arange(12).reshape((6, 2)),
    index=[['부산', '부산', '서울', '서울', '서울', '서울'],
           [2000, 2005, 2000, 2005, 2010, 2015]],
    columns=['데이터1', '데이터2'])
df1
# df2

   도시    연도       인구
0  서울  2000  9853972
1  서울  2005  9762546
2  서울  2010  9631482
3  부산  2000  3655437
4  부산  2005  3512547

In [190]:
df1.stack() # 도시, 연도, 인구 열이 하나의 행에 하위 행으로
df1.unstack() # 도시, 연도, 인구가 각각의 행으로

도시  0         서울
    1         서울
    2         서울
    3         부산
    4         부산
연도  0       2000
    1       2005
    2       2010
    3       2000
    4       2005
인구  0    9853972
    1    9762546
    2    9631482
    3    3655437
    4    3512547
dtype: object

In [175]:
df11 = df1.set_index('도시')
df11
pd.merge(df11,df2, left_on=['도시','연도'], right_index=True)
pd.merge(df11,df2, left_on=['도시','연도'], right_index=True, how='outer')

      연도         인구  데이터1  데이터2
도시
부산  2000  3655437.0     0     1
부산  2005  3512547.0     2     3
서울  2000  9853972.0     4     5
서울  2005  9762546.0     6     7
서울  2010  9631482.0     8     9
서울  2015        NaN    10    11

In [141]:
s1 = pd.Series([0, 1], index=['A', 'B'])
s2 = pd.Series([2, 3, 4], index=['A', 'B', 'C'])
s1, s2

(A    0
 B    1
 dtype: int64,
 A    2
 B    3
 C    4
 dtype: int64)

In [148]:
pd.concat([s1,s2],axis=1)

     0  1
A  0.0  2
B  1.0  3
C  NaN  4

In [151]:
df1 = pd.DataFrame(
    np.arange(6).reshape(3, 2),
    index=['a', 'b', 'c'],
    columns=['데이터1', '데이터2'])

df2 = pd.DataFrame(
    5 + np.arange(4).reshape(2, 2),
    index=['a', 'c'],
    columns=['데이터3', '데이터4'])

In [158]:
pd.concat([df1,df2])
pd.concat([df1,df2],axis=1) # axis로 중복 행 병합

   데이터1  데이터2  데이터3  데이터4
a   0.0   1.0   NaN   NaN
b   2.0   3.0   NaN   NaN
c   4.0   5.0   NaN   NaN
a   NaN   NaN   5.0   6.0
c   NaN   NaN   7.0   8.0

In [5]:
'''
- survived열 값으로 전체 생존율 출력
- pclass열 값이 1인 자료의 개수를 출력
- age가 10보다 작은 승객에 대한 생존율
- embarked(항구의 종류임) 중에서 각 항구별 승선인원 출력(embark_town에 나와있음)
'''
import seaborn as sns
titanic = sns.load_dataset("titanic")
# titanic.info()
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [202]:
# - survived열 값으로 전체 생존율 출력
titanic['survived'].mean()

0.3838383838383838

In [222]:
# - pclass열 값이 1인 자료의 개수를 출력
titanic['pclass'].value_counts()
titanic.pclass.value_counts()

pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [237]:
# - age가 10보다 작은 승객에 대한 생존율
# titanic['survived'][titanic['age']<10].value_counts()
titanic['survived'][titanic['age']<10].mean()

0.6129032258064516

In [239]:
# - embarked(항구의 종류임) 중에서 각 항구별 승선인원 출력(embark_town에 나와있음)
titanic['embarked'].value_counts()

embarked
S    644
C    168
Q     77
Name: count, dtype: int64